
#Область СведенияОбОбработке

Функция СведенияОВнешнейОбработке()Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.АктВыполненныхРабот");
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ОтчетУдовлетворенности");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", "Отчет Удовлетворенности"); 
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Отчет Удовлетворенности", "Макет", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции


Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Макет", "Отчет Удовлетворенности", СформироватьПечатнуюФорму(МассивОбъектов[0]));
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФорму(СсылкаНаДокумент) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	ЗаполнитьСтруктуруПараметровШаблона(СсылкаНаДокумент, СтруктураПараметров);	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;	
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапки   = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");       	
	
	ОбластьШапки.Параметры.Номер = СсылкаНаДокумент.Номер;
	ОбластьШапки.Параметры.Дата = Формат(СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапки.Параметры.Контрагент = СсылкаНаДокумент.Контрагент;
	ТабличныйДокумент.Вывести(ОбластьШапки);   
	
	Для Каждого Строка ИЗ СсылкаНаДокумент.РаботыИУслуги Цикл 
		ОбластьСтрокаТаблицы.Параметры.Номенклатура = Строка.Номенклатура;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла; 

	ОбластьПодвал.Параметры.ДатаАктаПлюсТриДня = Формат(СсылкаНаДокумент.Дата + 86400 * 3, "ДФ=dd.MM.yyyy");    
	ОбластьПодвал.Параметры.Ответственный = СсылкаНаДокумент.Ответственный;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьСтруктуруПараметровШаблона(СсылкаНаОбъект, СтруктураПШ, ДатаДанных = Неопределено)
	
	СтруктураПШ.Вставить("ШаблонПараметра", "Шаблон текста");	
	
КонецПроцедуры



